cmsis-svd/cmsis-svd/data/Spansion/MB9BF11xR_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL47" -->
    <peripheral>
      <name>BTIOSEL47</name>
      <description> Base Timer I/O Select</description>
      <groupName>BTIOSEL47</groupName>
      <baseAddress>0x40025300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL4567" -->
        <register>
          <name>BTSEL4567</name>
          <description>I/O Select Register</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL67_" -->
            <field>
              <name>SEL67_</name>
              <description>I/O select bits for Ch.6/Ch.7 </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL45_" -->
            <field>
              <name>SEL45_</name>
              <description>I/O select bits for Ch.4/Ch.5</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description>Software-based Simultaneous Startup Register</description>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description>Software-based Simultaneous Startup Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR15" -->
            <field>
              <name>SSSR15</name>
              <description>Bit15 of BTSSSR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR14" -->
            <field>
              <name>SSSR14</name>
              <description>Bit14 of BTSSSR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR13" -->
            <field>
              <name>SSSR13</name>
              <description>Bit13 of BTSSSR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR12" -->
            <field>
              <name>SSSR12</name>
              <description>Bit12 of BTSSSR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR11" -->
            <field>
              <name>SSSR11</name>
              <description>Bit11 of BTSSSR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR10" -->
            <field>
              <name>SSSR10</name>
              <description>Bit10 of BTSSSR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR9" -->
            <field>
              <name>SSSR9</name>
              <description>Bit9 of BTSSSR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR8" -->
            <field>
              <name>SSSR8</name>
              <description>Bit8 of BTSSSR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR7" -->
            <field>
              <name>SSSR7</name>
              <description>Bit7 of BTSSSR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR6" -->
            <field>
              <name>SSSR6</name>
              <description>Bit6 of BTSSSR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR5" -->
            <field>
              <name>SSSR5</name>
              <description>Bit5 of BTSSSR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR4" -->
            <field>
              <name>SSSR4</name>
              <description>Bit4 of BTSSSR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description>Bit3 of BTSSSR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description>Bit2 of BTSSSR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description>Bit1 of BTSSSR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description>Bit0 of BTSSSR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
