cmsis-svd/cmsis-svd/data/Spansion/MB9BF11xR_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "GPIO" -->
    <peripheral>
      <name>GPIO</name>
      <description>General-purpose I/O ports</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40033000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x740</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PFR0" -->
        <register>
          <name>PFR0</name>
          <description>Port function setting register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0F" -->
            <field>
              <name>P0F</name>
              <description>Bit15 of PFR0</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0E" -->
            <field>
              <name>P0E</name>
              <description>Bit14 of PFR0</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0D" -->
            <field>
              <name>P0D</name>
              <description>Bit13 of PFR0</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0C" -->
            <field>
              <name>P0C</name>
              <description>Bit12 of PFR0</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0B" -->
            <field>
              <name>P0B</name>
              <description>Bit11 of PFR0</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0A" -->
            <field>
              <name>P0A</name>
              <description>Bit10 of PFR0</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P09" -->
            <field>
              <name>P09</name>
              <description>Bit9 of PFR0</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P08" -->
            <field>
              <name>P08</name>
              <description>Bit8 of PFR0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P07" -->
            <field>
              <name>P07</name>
              <description>Bit7 of PFR0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P06" -->
            <field>
              <name>P06</name>
              <description>Bit6 of PFR0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P05" -->
            <field>
              <name>P05</name>
              <description>Bit5 of PFR0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P04" -->
            <field>
              <name>P04</name>
              <description>Bit4 of PFR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P03" -->
            <field>
              <name>P03</name>
              <description>Bit3 of PFR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P02" -->
            <field>
              <name>P02</name>
              <description>Bit2 of PFR0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P01" -->
            <field>
              <name>P01</name>
              <description>Bit1 of PFR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P00" -->
            <field>
              <name>P00</name>
              <description>Bit0 of PFR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR1" -->
        <register>
          <name>PFR1</name>
          <description>Port function setting register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1F" -->
            <field>
              <name>P1F</name>
              <description>Bit15 of PFR1</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1E" -->
            <field>
              <name>P1E</name>
              <description>Bit14 of PFR1</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1D" -->
            <field>
              <name>P1D</name>
              <description>Bit13 of PFR1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1C" -->
            <field>
              <name>P1C</name>
              <description>Bit12 of PFR1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1B" -->
            <field>
              <name>P1B</name>
              <description>Bit11 of PFR1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1A" -->
            <field>
              <name>P1A</name>
              <description>Bit10 of PFR1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P19" -->
            <field>
              <name>P19</name>
              <description>Bit9 of PFR1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P18" -->
            <field>
              <name>P18</name>
              <description>Bit8 of PFR1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P17" -->
            <field>
              <name>P17</name>
              <description>Bit7 of PFR1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P16" -->
            <field>
              <name>P16</name>
              <description>Bit6 of PFR1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P15" -->
            <field>
              <name>P15</name>
              <description>Bit5 of PFR1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P14" -->
            <field>
              <name>P14</name>
              <description>Bit4 of PFR1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P13" -->
            <field>
              <name>P13</name>
              <description>Bit3 of PFR1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P12" -->
            <field>
              <name>P12</name>
              <description>Bit2 of PFR1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P11" -->
            <field>
              <name>P11</name>
              <description>Bit1 of PFR1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P10" -->
            <field>
              <name>P10</name>
              <description>Bit0 of PFR1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR2" -->
        <register>
          <name>PFR2</name>
          <description>Port function setting register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x000001FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P28" -->
            <field>
              <name>P28</name>
              <description>Bit8 of PFR2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P27" -->
            <field>
              <name>P27</name>
              <description>Bit7 of PFR2</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P26" -->
            <field>
              <name>P26</name>
              <description>Bit6 of PFR2</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P25" -->
            <field>
              <name>P25</name>
              <description>Bit5 of PFR2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P24" -->
            <field>
              <name>P24</name>
              <description>Bit4 of PFR2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P23" -->
            <field>
              <name>P23</name>
              <description>Bit3 of PFR2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P22" -->
            <field>
              <name>P22</name>
              <description>Bit2 of PFR2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P21" -->
            <field>
              <name>P21</name>
              <description>Bit1 of PFR2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P20" -->
            <field>
              <name>P20</name>
              <description>Bit0 of PFR2</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR3" -->
        <register>
          <name>PFR3</name>
          <description>Port function setting register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3F" -->
            <field>
              <name>P3F</name>
              <description>Bit15 of PFR3</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3E" -->
            <field>
              <name>P3E</name>
              <description>Bit14 of PFR3</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3D" -->
            <field>
              <name>P3D</name>
              <description>Bit13 of PFR3</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3C" -->
            <field>
              <name>P3C</name>
              <description>Bit12 of PFR3</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3B" -->
            <field>
              <name>P3B</name>
              <description>Bit11 of PFR3</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3A" -->
            <field>
              <name>P3A</name>
              <description>Bit10 of PFR3</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P39" -->
            <field>
              <name>P39</name>
              <description>Bit9 of PFR3</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P38" -->
            <field>
              <name>P38</name>
              <description>Bit8 of PFR3</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P37" -->
            <field>
              <name>P37</name>
              <description>Bit7 of PFR3</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P36" -->
            <field>
              <name>P36</name>
              <description>Bit6 of PFR3</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P35" -->
            <field>
              <name>P35</name>
              <description>Bit5 of PFR3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P34" -->
            <field>
              <name>P34</name>
              <description>Bit4 of PFR3</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P33" -->
            <field>
              <name>P33</name>
              <description>Bit3 of PFR3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P32" -->
            <field>
              <name>P32</name>
              <description>Bit2 of PFR3</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P31" -->
            <field>
              <name>P31</name>
              <description>Bit1 of PFR3</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P30" -->
            <field>
              <name>P30</name>
              <description>Bit0 of PFR3</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR4" -->
        <register>
          <name>PFR4</name>
          <description>Port function setting register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P4E" -->
            <field>
              <name>P4E</name>
              <description>Bit14 of PFR4</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4D" -->
            <field>
              <name>P4D</name>
              <description>Bit13 of PFR4</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4C" -->
            <field>
              <name>P4C</name>
              <description>Bit12 of PFR4</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4B" -->
            <field>
              <name>P4B</name>
              <description>Bit11 of PFR4</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4A" -->
            <field>
              <name>P4A</name>
              <description>Bit10 of PFR4</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P49" -->
            <field>
              <name>P49</name>
              <description>Bit9 of PFR4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P48" -->
            <field>
              <name>P48</name>
              <description>Bit8 of PFR4</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of PFR4</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of PFR4</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P45" -->
            <field>
              <name>P45</name>
              <description>Bit5 of PFR4</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P44" -->
            <field>
              <name>P44</name>
              <description>Bit4 of PFR4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P43" -->
            <field>
              <name>P43</name>
              <description>Bit3 of PFR4</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P42" -->
            <field>
              <name>P42</name>
              <description>Bit2 of PFR4</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P41" -->
            <field>
              <name>P41</name>
              <description>Bit1 of PFR4</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P40" -->
            <field>
              <name>P40</name>
              <description>Bit0 of PFR4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
